BOT_TOKEN = "6540946269:AAFS9VxfD93UHtPHpFs5oNmENN34OCvNjzQ"

user_states_file = 'user_states.json'

start_text = ("🌿 Добро пожаловать в 'Систему автоматического контроля гровбоксом' САК-1г 🌿"
              "\n🤖 Это набросок приложения на основе телеграм бота 🤖"
              "\n🚨 Может уведомлять о критичных показателях пользователю 🚨"
              "\n🌱 Ну и удобный контроль 🌱")


info_text =("🌡️ Текущая температура: 20°C"
            "\n"
            "\n💧 Влажность воздуха: 35%"
            "\n"
            "\n💦 Влажность почвы: 45%"
            "\n"
            "\n☀️ Освещение: Включено"
            "\n"
            "\n💨 Обдув: Включен"
            "\n"
            "\n🌱 Дней роста: 20")
